In [1]:
import pandas as pd
import numpy as np
import re
from pathlib import Path

print("pandas:", pd.__version__)

pandas: 2.2.3

In [5]:
DATA_PATH = Path(r"C:\Users\shwet\python pro\usa_healthcare_obesity_cardiac\data\raw_cdc_health_data.csv") 

assert DATA_PATH.exists(), f"File not found: {DATA_PATH}"
df = pd.read_csv(DATA_PATH)
df.head()

,YearStart,LocationAbbr,LocationDesc,Topic,Question,Data_Value,Age(years),Education,Sex,Income,Race/Ethnicity,GeoLocation
0,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,34.8,NaN,NaN,NaN,"$15,000 - $24,999",NaN,"(32.840571122, -86.631860762)"
1,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,35.8,NaN,NaN,NaN,"$25,000 - $34,999",NaN,"(32.840571122, -86.631860762)"
2,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,32.3,NaN,NaN,NaN,"$35,000 - $49,999",NaN,"(32.840571122, -86.631860762)"
3,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,34.1,NaN,NaN,NaN,"$50,000 - $74,999",NaN,"(32.840571122, -86.631860762)"
4,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,28.8,NaN,NaN,NaN,"$75,000 or greater",NaN,"(32.840571122, -86.631860762)"

In [6]:
# 1. Rename tricky columns
df = df.rename(columns={
    "Age(years)": "Age",
    "Race/Ethnicity": "Race_Ethnicity"
})

In [7]:
# 2. Strip extra spaces from text columns
text_cols = ["LocationAbbr","LocationDesc","Topic","Question","Age",
             "Education","Sex","Income","Race_Ethnicity","GeoLocation"]

In [8]:
for col in text_cols:
    if col in df.columns:
        df[col] = df[col].astype(str).str.strip()

In [9]:
# 3. Convert numeric columns
df["Data_Value"] = pd.to_numeric(df["Data_Value"], errors="coerce")

In [10]:
# 4. Drop rows where Data_Value is missing
df = df[df["Data_Value"].notna()]

In [11]:
# 5. Remove fully empty rows (just in case)
df = df.dropna(how="all")

In [12]:
# 6. Extract Latitude/Longitude from GeoLocation if needed
def extract_lat_lon(value):
    if isinstance(value, str):
        match = re.findall(r"([-+]?[0-9]*\.?[0-9]+)", value)
        if len(match) >= 2:
            return float(match[0]), float(match[1])
    return np.nan, np.nan

df["Latitude"], df["Longitude"] = zip(*df["GeoLocation"].apply(extract_lat_lon))

df.head()

,YearStart,LocationAbbr,LocationDesc,Topic,Question,Data_Value,Age,Education,Sex,Income,Race_Ethnicity,GeoLocation,Latitude,Longitude
0,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,34.8,nan,nan,nan,"$15,000 - $24,999",nan,"(32.840571122, -86.631860762)",32.840571,-86.631861
1,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,35.8,nan,nan,nan,"$25,000 - $34,999",nan,"(32.840571122, -86.631860762)",32.840571,-86.631861
2,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,32.3,nan,nan,nan,"$35,000 - $49,999",nan,"(32.840571122, -86.631860762)",32.840571,-86.631861
3,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,34.1,nan,nan,nan,"$50,000 - $74,999",nan,"(32.840571122, -86.631860762)",32.840571,-86.631861
4,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,28.8,nan,nan,nan,"$75,000 or greater",nan,"(32.840571122, -86.631860762)",32.840571,-86.631861

In [18]:
# replace NaN or empty text fields with a standard label

cols_to_fix = ["Age", "Education", "Sex", "Income", "Race_Ethnicity"]

for col in cols_to_fix:
    df[col] = df[col].fillna("Unknown")
    df[col] = df[col].replace("", "Unknown")
    df[col] = df[col].replace(" ", "Unknown")
    df[col] = df[col].replace("nan", "Unknown")

In [19]:
df[cols_to_fix].isna().sum(), df[cols_to_fix].apply(lambda x: (x=="Unknown").sum())

(Age               0
 Education         0
 Sex               0
 Income            0
 Race_Ethnicity    0
 dtype: int64,
 Age               71401
 Education         78769
 Sex               86137
 Income            67722
 Race_Ethnicity    73675
 dtype: int64)

In [20]:
df["Age"] = df["Age"].str.replace("years", "", regex=False)
df["Age"] = df["Age"].str.strip()

In [21]:
import sqlite3

conn = sqlite3.connect("obesity_db.db")
df.to_sql("obesity_table", conn, if_exists="replace", index=False)

93505

In [22]:
pd.read_sql_query("SELECT * FROM obesity_table LIMIT 10;", conn)

,YearStart,LocationAbbr,LocationDesc,Topic,Question,Data_Value,Age,Education,Sex,Income,Race_Ethnicity,GeoLocation,Latitude,Longitude
0,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,34.8,Unknown,Unknown,Unknown,"$15,000 - $24,999",Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
1,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,35.8,Unknown,Unknown,Unknown,"$25,000 - $34,999",Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
2,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,32.3,Unknown,Unknown,Unknown,"$35,000 - $49,999",Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
3,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,34.1,Unknown,Unknown,Unknown,"$50,000 - $74,999",Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
4,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,28.8,Unknown,Unknown,Unknown,"$75,000 or greater",Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
5,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,16.3,18 - 24,Unknown,Unknown,Unknown,Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
6,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,27.8,Unknown,Unknown,Unknown,Unknown,2 or more races,"(32.840571122, -86.631860762)",32.840571,-86.631861
7,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,35.2,25 - 34,Unknown,Unknown,Unknown,Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
8,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,35.5,35 - 44,Unknown,Unknown,Unknown,Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861
9,2011,AL,Alabama,Obesity / Weight Status,Percent of adults aged 18 years and older who ...,38.0,45 - 54,Unknown,Unknown,Unknown,Unknown,"(32.840571122, -86.631860762)",32.840571,-86.631861

In [23]:
query = """
SELECT YearStart AS Year,
       AVG(Data_Value) AS Avg_Obesity
FROM obesity_table
GROUP BY YearStart
ORDER BY YearStart;
"""

pd.read_sql_query(query, conn)

    Year  Avg_Obesity
0   2011    31.476523
1   2012    29.029325
2   2013    31.618743
3   2014    29.419446
4   2015    31.912973
5   2016    29.850826
6   2017    31.066713
7   2018    30.444787
8   2019    32.779247
9   2020    30.462652
10  2021    31.213404
11  2022    31.034663
12  2023    37.362954

In [24]:
query = """
SELECT LocationDesc AS State,
       AVG(Data_Value) AS Avg_Obesity
FROM obesity_table
GROUP BY LocationDesc
ORDER BY Avg_Obesity DESC
LIMIT 10;
"""

pd.read_sql_query(query, conn)

            State  Avg_Obesity
0  Virgin Islands    33.805924
1            Guam    33.195538
2       Louisiana    32.941701
3          Alaska    32.929989
4      New Mexico    32.799200
5     Puerto Rico    32.734215
6        Arkansas    32.666069
7         Wyoming    32.578973
8       Wisconsin    32.453588
9     Mississippi    32.434098

In [25]:
query = """
SELECT Sex,
       AVG(Data_Value) AS Avg_Obesity
FROM obesity_table
WHERE Sex IS NOT NULL
GROUP BY Sex
ORDER BY Avg_Obesity DESC;
"""

pd.read_sql_query(query, conn)

       Sex  Avg_Obesity
0     Male    33.527904
1  Unknown    31.852476
2   Female    30.097937

In [26]:
query = """
SELECT Age,
       AVG(Data_Value) AS Avg_Obesity
FROM obesity_table
GROUP BY Age
ORDER BY Avg_Obesity DESC;
"""

pd.read_sql_query(query, conn)

           Age  Avg_Obesity
0  65 or older    33.108035
1      55 - 64    33.066558
2      45 - 54    32.667400
3      Unknown    31.911616
4      35 - 44    31.691558
5      25 - 34    30.571444
6      18 - 24    28.784528

In [27]:
query = """
SELECT Education,
       AVG(Data_Value) AS Avg_Obesity
FROM obesity_table
GROUP BY Education
ORDER BY Avg_Obesity DESC;
"""

pd.read_sql_query(query, conn)

                       Education  Avg_Obesity
0          Less than high school    32.799430
1           High school graduate    32.430863
2  Some college or technical sch    32.015852
3                        Unknown    31.827649
4               College graduate    30.615472

In [28]:
query = """
SELECT Income,
       AVG(Data_Value) AS Avg_Obesity
FROM obesity_table
GROUP BY Income
ORDER BY Avg_Obesity DESC;
"""

pd.read_sql_query(query, conn)

               Income  Avg_Obesity
0   Less than $15,000    32.462079
1   $15,000 - $24,999    32.447096
2   $25,000 - $34,999    32.273236
3   $35,000 - $49,999    32.220874
4   $50,000 - $74,999    32.038462
5             Unknown    31.803479
6  $75,000 or greater    31.660261
7   Data not reported    30.687161

In [29]:
df.to_csv("cleaned_obesity_data.csv", index=False)

In [30]:
import os
os.listdir()

['.ipynb_checkpoints',
 '01_clean_and_query.ipynb',
 'cleaned_obesity_data.csv',
 'obesity_data.db',
 'obesity_db.db']